# Тестовые данные для таблицы Universities
UNIVERSITIES = [
    ("Московский государственный университет",
     "Москва, Ленинские горы, 1", "1755-01-25"),
    ("Санкт-Петербургский государственный университет",
     "Санкт-Петербург, Университетская наб., 7/9", "1724-02-07"),
]

# Тестовые данные для таблицы Institutes
INSTITUTES = [
    (1, "Институт механики"),
    (2, "Институт механики"),
]

# Тестовые данные для таблицы Departments
DEPARTMENTS = [
    # Для "Институт механики" (institute_id = 1)
    (1, "Кафедра теоретической механики"),
    # Для "Институт механики" (institute_id = 2)
    (2, "Кафедра динамики машин"),
]

# Тестовые данные для таблицы Specialties
SPECIALTIES = [
    # Формат: (code, name)
    ("01.03.04", "Прикладная механика"),
    # ("03.03.02", "Физика"),
    ("15.03.06", "Мехатроника и робототехника"),
    # ("03.03.03", "Астрономия")
]

# Тестовые данные для таблицы Student_Groups name, department_id, specialty_id, course_year
STUDENT_GROUPS = [
    # Формат: (department_id, name, course_year)
    # Группы для department_id=1 (Кафедра теоретической механики)
    (1, "МЕХ-101", 1),  # 1 курс
    # (1, "МЕХ-203", 2),  # 2 курс
    # Группы для department_id=2 (Кафедра общей физики)
    (2, "ФИЗ-102", 1),  # 1 курс
    # (2, "ФИЗ-204", 2)   # 2 курс
]

STUDENTS = [
    # Группа 1 (МЕХ-101)
    (1, "Иванов Иван", 2023, "2002-05-12", "ivan.ivanov@university.edu", "01001"),
    (1, "Петров Алексей", 2023, "2001-08-23",
     "alexey.petrov@university.edu", "01002"),
    (1, "Сидорова Мария", 2023, "2002-11-30",
     "maria.sidorova@university.edu", "01003"),
    (1, "Кузнецов Дмитрий", 2023, "2001-03-15",
     "dmitry.kuznetsov@university.edu", "01004"),
    (1, "Смирнова Анна", 2023, "2002-07-08",
     "anna.smirnova@university.edu", "01005"),
    (1, "Попов Михаил", 2023, "2001-09-21",
     "mikhail.popov@university.edu", "01006"),
    (1, "Федоров Сергей", 2023, "2000-04-17",
     "sergey.fedorov@university.edu", "02001"),
    (1, "Морозова Екатерина", 2023, "2001-01-25",
     "ekaterina.morozova@university.edu", "02002"),
    (1, "Васильев Андрей", 2023, "2000-12-05",
     "andrey.vasilyev@university.edu", "02003"),
    (1, "Новикова Ольга", 2023, "2001-06-14",
     "olga.novikova@university.edu", "02004"),
    (1, "Лебедев Артем", 2023, "2000-02-28",
     "artem.lebedev@university.edu", "02005"),
    (1, "Козлова Наталья", 2023, "2001-10-11",
     "natalia.kozlova@university.edu", "02006"),

    # Группа 2 (ФИЗ-102)
    (2, "Павлов Игорь", 2023, "2002-05-19", "igor.pavlov@university.edu", "03001"),
    (2, "Громова Виктория", 2023, "2001-07-22",
     "victoria.gromova@university.edu", "03002"),
    (2, "Белов Александр", 2023, "2002-09-03",
     "alexander.belov@university.edu", "03003"),
    (2, "Волкова Елена", 2023, "2001-04-16",
     "elena.volkova@university.edu", "03004"),
    (2, "Медведев Павел", 2023, "2002-08-07",
     "pavel.medvedev@university.edu", "03005"),
    (2, "Орлова Дарья", 2023, "2001-11-29",
     "darya.orlova@university.edu", "03006"),
    (2, "Тихонов Николай", 2023, "2000-03-10",
     "nikolay.tikhonov@university.edu", "04001"),
    (2, "Жукова Анастасия", 2023, "2001-02-18",
     "anastasia.zhukova@university.edu", "04002"),
    (2, "Данилов Максим", 2023, "2000-07-24",
     "maxim.danilov@university.edu", "04003"),
    (2, "Савельева Юлия", 2023, "2001-05-31",
     "julia.savelieva@university.edu", "04004"),
    (2, "Гусев Владимир", 2023, "2000-09-12",
     "vladimir.gusev@university.edu", "04005"),
    (2, "Романова Ирина", 2023, "2001-12-27",
     "irina.romanova@university.edu", "04006")
]

# Для "Кафедра теоретической механики" (department_id=1)
COURSE_OF_CLASSES = [
    (
        1,                        # department_id
        1,                        # specialty_id
        "Теоретическая механика",  # name
        "Основы классической механики",  # description
        "Доска, маркеры, проектор, калькулятор"  # tech_requirements
    ),
    # Для "Кафедра астрофизики" (department_id=2)
    (
        2,
        2,
        "Введение в астрофизику",
        "Основы физики космоса",
        "Доска, маркеры, проектор, измерительные приборы, бумага"
    ),
]

CLASSES = [
    # course_of_class_id = 1 (Теоретическая механика)
    ("Кинематика точки и твёрдого тела", 1, "Специальный тэг", "лекция"),
    ("Динамика материальной точки", 1, "Специальный тэг", "лекция"),
    ("Теоремы об изменении энергии и импульса", 1, "Обычный тэг", "лекция"),
    # ("Аналитическая механика: уравнения Лагранжа", 1, "лекция"),
    # ("Гироскопические системы", 1, "лекция"),
    # ("Устойчивость движения", 1, "лекция"),
    ("Решение задач на кинематику", 1, "Обычный тэг", "практика"),
    ("Разбор задач по динамике", 1, "Обычный тэг", "практика"),
    ("Применение теорем о сохранении", 1, "Специальный тэг", "практика"),
    # ("Лагранжева механика на примерах", 1, "практика"),
    # ("Эксперименты с гироскопами", 1, "практика"),
    # ("Расчёты устойчивости механических систем", 1, "практика"),
    # course_of_class_id = 2 (Введение в астрофизику)
    ("Основы астрономических наблюдений",  2, "Специальный тэг", "лекция"),
    ("Строение и эволюция звёзд", 2, "Обычный тэг", "лекция"),
    ("Космология: теория Большого взрыва", 2, "Специальный тэг", "лекция"),
    # ("Чёрные дыры и нейтронные звёзды", 2, "лекция"),
    # ("Галактики и их классификация", 2, "лекция"),
    # ("Тёмная материя и тёмная энергия", 2, "лекция"),
    ("Работа с астрономическими данными", 2, "Специальный тэг", "практика"),
    ("Расчёт параметров звёзд", 2, "Обычный тэг", "практика"),
    ("Моделирование расширения Вселенной", 2, "Специальный тэг", "практика"),
    # ("Анализ излучения чёрных дыр", 2, "практика"),
    # ("Изучение структуры галактик", 2, "практика"),
    # ("Эксперименты по обнаружению тёмной материи", 2, "практика")
]

CLASS_MATERIALS = [
    (1, "Конспект лекции по кинематике точки и твёрдого тела"),
    (2, "Конспект лекции по динамике материальной точки"),
    (3, "Конспект лекции по теоремам об изменении энергии и импульса"),
    # (4, "Конспект лекции по аналитической механике (уравнения Лагранжа)"),
    # (5, "Конспект лекции по гироскопическим системам"),
    # (6, "Конспект лекции по устойчивости движения"),
    (4, "Задачи для практики по кинематике"),
    (5, "Задачи для практики по динамике"),
    (6, "Задачи на применение теорем о сохранении"),
    # (10, "Примеры решений уравнений Лагранжа"),
    # (11, "Инструкция к лабораторной работе с гироскопами"),
    # (12, "Методичка по расчётам устойчивости"),
    (7, "Конспект лекции по основам астрономических наблюдений"),
    (8, "Конспект лекции по строению и эволюции звёзд"),
    (9, "Конспект лекции по космологии (теория Большого взрыва)"),
    # (10, "Конспект лекции по чёрным дырам и нейтронным звёздам"),
    # (17, "Конспект лекции по галактикам и их классификации"),
    # (18, "Конспект лекции по тёмной материи и тёмной энергии"),
    (10, "Набор астрономических данных для анализа"),
    (11, "Формулы и методики расчёта параметров звёзд"),
    (12, "Программное обеспечение для моделирования Вселенной"),
    # (22, "Данные наблюдений излучения чёрных дыр"),
    # (23, "Атлас галактик для изучения структуры"),
    # (24, "Экспериментальные методы поиска тёмной материи")
]

SCHEDULE = [
    # Группа 1 (Теоретическая механика)
    (1, 1, "101", "2023-09-01", "09:00", "10:30"),  # Лекция 1
    (1, 4, "102", "2023-09-01", "10:40", "12:10"),  # Практика 1
    (1, 2, "101", "2023-09-08", "09:00", "10:30"),  # Лекция 2
    (1, 5, "102", "2023-09-08", "10:40", "12:10"),  # Практика 2
    (1, 3, "101", "2023-09-15", "09:00", "10:30"),  # Лекция 3
    (1, 6, "102", "2023-09-15", "10:40", "12:10"),  # Практика 3
    # Группа 2 (Астрофизика)
    (2, 7, "201", "2023-09-02", "09:00", "10:30"),  # Лекция 1
    (2, 10, "202", "2023-09-02", "10:40", "12:10"),  # Практика 1
    (2, 8, "201", "2023-09-09", "09:00", "10:30"),  # Лекция 2
    (2, 11, "202", "2023-09-09", "10:40", "12:10"),  # Практика 2
    (2, 9, "201", "2023-09-16", "09:00", "10:30"),  # Лекция 3
    (2, 12, "202", "2023-09-16", "10:40", "12:10")   # Практика 3
]

# Самые худшие студенты (Группа 1) 7 (0/6), 8 (1/6), 2 (2/6), 3 (2/6),


# Самые худшие студенты по лекциям (Группа 1) 1 (0/3), 7 (0/3), 2 (0/3),  3 (0/3), 8 (1/3), 9 (1/3), 12 (2/3), 11 (2/3), 10 (2/3), 4 (2/3)
ATTENDANCE = [
    # Группа 1 (schedule_id 1-6)
    # schedule_id 1 (Лекция 1)
    (1, 1, False), (1, 2, False), (1, 3, False), (1,
                                                  4, True), (1, 5, True), (1, 6, True),
    (1, 7, False), (1, 8, True), (1, 9, False), (1,
                                                 10, True), (1, 11, True), (1, 12, False),
    # schedule_id 3 (Лекция 2)
    (3, 1, False), (3, 2, False), (3, 3, False), (3,
                                                  4, False), (3, 5, True), (3, 6, True),
    (3, 7, False), (3, 8, False), (3, 9, True), (3,
                                                 10, False), (3, 11, True), (3, 12, True),
    # schedule_id 5 (Лекция 3)
    (5, 1, False), (5, 2, False), (5, 3, False), (5,
                                                  4, True), (5, 5, True), (5, 6, True),
    (5, 7, False), (5, 8, False), (5, 9, False), (5,
                                                  10, True), (5, 11, False), (5, 12, True),
    # schedule_id 2 (Практика 1)
    (2, 1, False), (2, 2, True), (2, 3, True), (2,
                                                4, True), (2, 5, True), (2, 6, True),
    (2, 7, False), (2, 8, False), (2, 9, True), (2,
                                                 10, True), (2, 11, True), (2, 12, True),

    # schedule_id 4 (Практика 2)
    (4, 1, False), (4, 2, True), (4, 3, True), (4,
                                                4, True), (4, 5, True), (4, 6, True),
    (4, 7, False), (4, 8, False), (4, 9, False), (4,
                                                  10, True), (4, 11, True), (4, 12, True),

    # schedule_id 6 (Практика 3)
    (6, 1, False), (6, 2, False), (6, 3, False), (6,
                                                  4, True), (6, 5, True), (6, 6, True),
    (6, 7, False), (6, 8, False), (6, 9, False), (6,
                                                  10, True), (6, 11, True), (6, 12, True),

    # Группа 2 (schedule_id 7-12)
    # schedule_id 7 (Лекция 1)
    (7, 13, True), (7, 14, True), (7, 15, True), (7,
                                                  16, True), (7, 17, True), (7, 18, True),
    (7, 19, False), (7, 20, True), (7, 21, True), (7,
                                                   22, True), (7, 23, True), (7, 24, True),

    # schedule_id 8 (Практика 1)
    (8, 13, True), (8, 14, False), (8, 15, True), (8,
                                                   16, True), (8, 17, True), (8, 18, True),
    (8, 19, True), (8, 20, True), (8, 21, True), (8,
                                                  22, False), (8, 23, True), (8, 24, True),

    # schedule_id 9 (Лекция 2)
    (9, 13, True), (9, 14, True), (9, 15, True), (9,
                                                  16, True), (9, 17, False), (9, 18, True),
    (9, 19, True), (9, 20, True), (9, 21, True), (9,
                                                  22, True), (9, 23, True), (9, 24, False),

    # schedule_id 10 (Практика 2)
    (10, 13, True), (10, 14, True), (10, 15, False), (10,
                                                      16, True), (10, 17, True), (10, 18, True),
    (10, 19, True), (10, 20, True), (10, 21, True), (10,
                                                     22, True), (10, 23, False), (10, 24, True),

    # schedule_id 11 (Лекция 3)
    (11, 13, True), (11, 14, True), (11, 15, True), (11,
                                                     16, True), (11, 17, True), (11, 18, True),
    (11, 19, False), (11, 20, True), (11, 21, True), (11,
                                                      22, True), (11, 23, True), (11, 24, True),

    # schedule_id 12 (Практика 3)
    (12, 13, True), (12, 14, True), (12, 15, True), (12,
                                                     16, False), (12, 17, True), (12, 18, True),
    (12, 19, True), (12, 20, True), (12, 21, False), (12,
                                                      22, True), (12, 23, True), (12, 24, True)
]
